# Day 2 mission

## 과제 1
- 다음의 데이터를 로드하세요
```python
idx = ['r0', 'r1', 'r2', 'r3', 'r4']
df = pd.DataFrame({
    'c1': np.arange(5),
    'c2': np.random.randn(5)},
    index=idx)
```

- [r3, r4]를 빼고, [r5, r6]을 새로 추가해보세요. 이때 값들은 전부 0으로 채워주세요
아래와 같은 결괏값이 나와야 합니다

In [1]:
import pandas as pd
import numpy as np

In [2]:
idx = ['r0', 'r1', 'r2', 'r3', 'r4']
df = pd.DataFrame({
  'c1': np.arange(5),
  'c2': np.random.randn(5)},
  index=idx)

In [8]:
new_idx = ['r0', 'r1', 'r2', 'r5', 'r6']
df = df.reindex(index = new_idx)
df

     c1        c2
r0  0.0 -0.427990
r1  1.0  0.568750
r2  2.0 -1.220974
r5  NaN       NaN
r6  NaN       NaN

In [9]:
df = df.fillna(0)
df

     c1        c2
r0  0.0 -0.427990
r1  1.0  0.568750
r2  2.0 -1.220974
r5  0.0  0.000000
r6  0.0  0.000000

In [23]:
# 시계열 데이터 index 만들기

date_idx = pd.date_range('25/01/2022',periods=5,  freq='D')
date_idx

DatetimeIndex(['2022-01-25', '2022-01-26', '2022-01-27', '2022-01-28',
               '2022-01-29'],
              dtype='datetime64[ns]', freq='D')

In [24]:
df_2 = pd.DataFrame({"c1": [10, 20, 30, 40, 50]}, index=date_idx)
df_2

            c1
2022-01-25  10
2022-01-26  20
2022-01-27  30
2022-01-28  40
2022-01-29  50

위의 dataFrame 에서 2022-01-20 ~ 2022-01-24 날짜의 데이터를 추가하고 이 때 가장 최근(2022-01-25)의 데이터로 값을 채워주세요

In [25]:
new_data_idx = pd.date_range('20/01/2022', periods=10, freq='D')
new_data_idx

DatetimeIndex(['2022-01-20', '2022-01-21', '2022-01-22', '2022-01-23',
               '2022-01-24', '2022-01-25', '2022-01-26', '2022-01-27',
               '2022-01-28', '2022-01-29'],
              dtype='datetime64[ns]', freq='D')

In [32]:
df_3 = df_2.reindex(new_data_idx)
df_3 = df_3.bfill()
df_3

              c1
2022-01-20  10.0
2022-01-21  10.0
2022-01-22  10.0
2022-01-23  10.0
2022-01-24  10.0
2022-01-25  10.0
2022-01-26  20.0
2022-01-27  30.0
2022-01-28  40.0
2022-01-29  50.0

In [33]:
new_data_idx_2 = pd.date_range('20/01/2022', periods=12, freq='D')
new_data_idx_2

DatetimeIndex(['2022-01-20', '2022-01-21', '2022-01-22', '2022-01-23',
               '2022-01-24', '2022-01-25', '2022-01-26', '2022-01-27',
               '2022-01-28', '2022-01-29', '2022-01-30', '2022-01-31'],
              dtype='datetime64[ns]', freq='D')

In [36]:
df_4 = df_3.reindex(new_data_idx_2)
df_4 = df_4.ffill()
df_4

              c1
2022-01-20  10.0
2022-01-21  10.0
2022-01-22  10.0
2022-01-23  10.0
2022-01-24  10.0
2022-01-25  10.0
2022-01-26  20.0
2022-01-27  30.0
2022-01-28  40.0
2022-01-29  50.0
2022-01-30  50.0
2022-01-31  50.0

## 과제 2

```python
df_1 = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                     'B': ['B0', 'B1', 'B2'],
                     'C': ['C0', 'C1', 'C2'],
                     'D': ['D0', 'D1', 'D2']},
                    index=[0, 1, 2])

df_2 = pd.DataFrame({'A': ['A3', 'A4', 'A5'],
                     'B': ['B3', 'B4', 'B5'],
                     'C': ['C3', 'C4', 'C5'],
                     'D': ['D3', 'D4', 'D5']},
                     index=[3, 4, 5])

df_3 = pd.DataFrame({'E': ['A6', 'A7', 'A8'],
                     'F': ['B6', 'B7', 'B8'],
                     'G': ['C6', 'C7', 'C8'],
                     'H': ['D6', 'D7', 'D8']},
                     index=[0, 1, 2])                     

df_4 = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                     'B': ['B0', 'B1', 'B2'],
                     'C': ['C0', 'C1', 'C2'],
                     'E': ['E0', 'E1', 'E2']},
                     index=[0, 1, 3])
```

In [37]:
df_1 = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                     'B': ['B0', 'B1', 'B2'],
                     'C': ['C0', 'C1', 'C2'],
                     'D': ['D0', 'D1', 'D2']},
                    index=[0, 1, 2])

df_2 = pd.DataFrame({'A': ['A3', 'A4', 'A5'],
                     'B': ['B3', 'B4', 'B5'],
                     'C': ['C3', 'C4', 'C5'],
                     'D': ['D3', 'D4', 'D5']},
                     index=[3, 4, 5])

df_3 = pd.DataFrame({'E': ['A6', 'A7', 'A8'],
                     'F': ['B6', 'B7', 'B8'],
                     'G': ['C6', 'C7', 'C8'],
                     'H': ['D6', 'D7', 'D8']},
                     index=[0, 1, 2])                     

df_4 = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                     'B': ['B0', 'B1', 'B2'],
                     'C': ['C0', 'C1', 'C2'],
                     'E': ['E0', 'E1', 'E2']},
                     index=[0, 1, 3])

In [44]:
data_1 = pd.concat([df_1, df_2], axis = 0)
data_1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3
4  A4  B4  C4  D4
5  A5  B5  C5  D5

In [46]:
data_2 = pd.concat([df_1, df_3], axis = 1)
data_2

    A   B   C   D   E   F   G   H
0  A0  B0  C0  D0  A6  B6  C6  D6
1  A1  B1  C1  D1  A7  B7  C7  D7
2  A2  B2  C2  D2  A8  B8  C8  D8

In [49]:
data_3 = pd.concat([df_1, df_4], join= 'outer')
data_3

    A   B   C    D    E
0  A0  B0  C0   D0  NaN
1  A1  B1  C1   D1  NaN
2  A2  B2  C2   D2  NaN
0  A0  B0  C0  NaN   E0
1  A1  B1  C1  NaN   E1
3  A2  B2  C2  NaN   E2

In [50]:
data_4 = pd.concat([df_1, df_4], join= 'inner')
data_4

    A   B   C
0  A0  B0  C0
1  A1  B1  C1
2  A2  B2  C2
0  A0  B0  C0
1  A1  B1  C1
3  A2  B2  C2

In [52]:
data_5 = pd.concat([df_1, df_4], join= 'inner', axis=1)
data_5

    A   B   C   D   A   B   C   E
0  A0  B0  C0  D0  A0  B0  C0  E0
1  A1  B1  C1  D1  A1  B1  C1  E1

In [57]:
data_6= pd.concat([df_1, df_4], join= 'outer', axis=1)
data_6= data_6.reindex([0,1,2])
data_6

    A   B   C   D    A    B    C    E
0  A0  B0  C0  D0   A0   B0   C0   E0
1  A1  B1  C1  D1   A1   B1   C1   E1
2  A2  B2  C2  D2  NaN  NaN  NaN  NaN

## 과제 3
```python
df_1 = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                     'B': ['B0', 'B1', 'B2'],
                     'C': ['C0', 'C1', 'C2'],
                     'D': ['D0', 'D1', 'D2']},
                     index=[0, 1, 2])
```

In [58]:
df_1 = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                     'B': ['B0', 'B1', 'B2'],
                     'C': ['C0', 'C1', 'C2'],
                     'D': ['D0', 'D1', 'D2']},
                     index=[0, 1, 2])

In [82]:
df_1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2

In [60]:
df_s = pd.DataFrame({'S': ['S1', 'S2', 'S3']})
data_1 = pd.concat([df_1, df_s], axis=1)
data_1

    A   B   C   D   S
0  A0  B0  C0  D0  S1
1  A1  B1  C1  D1  S2
2  A2  B2  C2  D2  S3

In [105]:
df_s = pd.Series(['S1', 'S2', 'S3', 'S4'], index=['A', 'B', 'C', 'E'])
df_s

A    S1
B    S2
C    S3
E    S4
dtype: object

In [107]:
data_1.append(df_s, ignore_index=True)

    A   B   C    D    S    E
0  A0  B0  C0   D0   S1  NaN
1  A1  B1  C1   D1   S2  NaN
2  A2  B2  C2   D2   S3  NaN
3  S1  S2  S3  NaN  NaN   S4

## 과제 4

In [108]:
df_left = pd.DataFrame({'KEY': ['K0', 'K1', 'K2', 'K3'],
                        'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3']})

df_right = pd.DataFrame({'KEY': ['K2', 'K3', 'K4', 'K5'],
                         'C': ['C2', 'C3', 'C4', 'C5'],
                         'D': ['D2', 'D3', 'D4', 'D5']})

In [109]:
df_left

  KEY   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [110]:
df_right

  KEY   C   D
0  K2  C2  D2
1  K3  C3  D3
2  K4  C4  D4
3  K5  C5  D5

In [130]:


"""
나는 왜 안돼???
"""
pd.merge(left = df_left, right= df_right, how='left',  on='KEY')

  KEY   A   B    C    D
0  K0  A0  B0  NaN  NaN
1  K1  A1  B1  NaN  NaN
2  K2  A2  B2   C2   D2
3  K3  A3  B3   C3   D3

In [132]:
"""
여기도 나는 왜 안돼???
"""
pd.merge(left = df_left, right= df_right, how='right',  on='KEY')

  KEY    A    B   C   D
0  K2   A2   B2  C2  D2
1  K3   A3   B3  C3  D3
2  K4  NaN  NaN  C4  D4
3  K5  NaN  NaN  C5  D5

In [133]:
pd.merge(left = df_left, right= df_right, how='outer',  on='KEY', indicator=True)

  KEY    A    B    C    D      _merge
0  K0   A0   B0  NaN  NaN   left_only
1  K1   A1   B1  NaN  NaN   left_only
2  K2   A2   B2   C2   D2        both
3  K3   A3   B3   C3   D3        both
4  K4  NaN  NaN   C4   D4  right_only
5  K5  NaN  NaN   C5   D5  right_only

## 과제 5

In [134]:
df_left = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3']},
                        index=['K0', 'K1', 'K2', 'K3'])

df_right = pd.DataFrame({'C': ['C2', 'C3', 'C4', 'C5'],
                         'D': ['D2', 'D3', 'D4', 'D5']},
                         index=['K2', 'K3', 'K4', 'K5'])

In [135]:
df_left

     A   B
K0  A0  B0
K1  A1  B1
K2  A2  B2
K3  A3  B3

In [136]:
df_right

     C   D
K2  C2  D2
K3  C3  D3
K4  C4  D4
K5  C5  D5

In [143]:
pd.merge(df_left, df_right, how='left', left_index=True, right_index=True)

     A   B    C    D
K0  A0  B0  NaN  NaN
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2
K3  A3  B3   C3   D3

In [144]:
pd.merge(df_left, df_right, how='right', left_index=True, right_index=True)

      A    B   C   D
K2   A2   B2  C2  D2
K3   A3   B3  C3  D3
K4  NaN  NaN  C4  D4
K5  NaN  NaN  C5  D5

In [145]:
pd.merge(df_left, df_right, how='inner', left_index=True, right_index=True)

     A   B   C   D
K2  A2  B2  C2  D2
K3  A3  B3  C3  D3

In [146]:
pd.merge(df_left, df_right, how='outer', left_index=True, right_index=True)

      A    B    C    D
K0   A0   B0  NaN  NaN
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3   A3   B3   C3   D3
K4  NaN  NaN   C4   D4
K5  NaN  NaN   C5   D5